In [12]:
import numpy as np
import pandas as pd

In [13]:
lista = [['Brasil', 'Brasil', 'Brasil', 'Argentina', 'Argentina', 'Argentina'],[2017, 2018, 2019, 2017, 2018, 2019]]

# Função 'zip'. Pega as duas listas acima e junta o 1º índice da primeira lista com o 1º índice da segunda lista.
tuplas = zip(*lista)

In [14]:
tuplas # é um objeto

In [15]:
tupla = list(tuplas)
tupla

[('Brasil', 2017),
 ('Brasil', 2018),
 ('Brasil', 2019),
 ('Argentina', 2017),
 ('Argentina', 2018),
 ('Argentina', 2019)]

In [17]:
multi = pd.MultiIndex.from_tuples(tupla)
multi

MultiIndex([(   'Brasil', 2017),
            (   'Brasil', 2018),
            (   'Brasil', 2019),
            ('Argentina', 2017),
            ('Argentina', 2018),
            ('Argentina', 2019)],
           )

In [19]:
df1 = pd.DataFrame(data = np.random.randn(6,2), index = multi, columns=['Exp Trigo', 'Exp Arroz'])
df1

                Exp Trigo  Exp Arroz
Brasil    2017   1.577931  -0.125352
          2018   0.678801   0.284601
          2019   1.475823  -1.302204
Argentina 2017  -0.611300   0.881105
          2018  -0.406731  -1.165026
          2019   0.341825  -0.041522

In [21]:
df1.index.names = ['País', 'Ano']
df1

                Exp Trigo  Exp Arroz
País      Ano
Brasil    2017   1.577931  -0.125352
          2018   0.678801   0.284601
          2019   1.475823  -1.302204
Argentina 2017  -0.611300   0.881105
          2018  -0.406731  -1.165026
          2019   0.341825  -0.041522

In [25]:
# Encontrando valores

df1['Exp Arroz']

País       Ano
Brasil     2017   -0.125352
           2018    0.284601
           2019   -1.302204
Argentina  2017    0.881105
           2018   -1.165026
           2019   -0.041522
Name: Exp Arroz, dtype: float64

In [27]:
df1.loc['Brasil']

      Exp Trigo  Exp Arroz
Ano
2017   1.577931  -0.125352
2018   0.678801   0.284601
2019   1.475823  -1.302204

In [28]:
df1.xs(2017, level=1)

           Exp Trigo  Exp Arroz
País
Brasil      1.577931  -0.125352
Argentina  -0.611300   0.881105

In [32]:
df1[:4]

                Exp Trigo  Exp Arroz
País      Ano
Brasil    2017   1.577931  -0.125352
          2018   0.678801   0.284601
          2019   1.475823  -1.302204
Argentina 2017  -0.611300   0.881105

In [33]:
# visualizando o DataFrame de outra maneira

df1.unstack()

          Exp Trigo                     Exp Arroz
Ano            2017      2018      2019      2017      2018      2019
País
Argentina -0.611300 -0.406731  0.341825  0.881105 -1.165026 -0.041522
Brasil     1.577931  0.678801  1.475823 -0.125352  0.284601 -1.302204

In [36]:
df2 = df1.unstack()
df2

          Exp Trigo                     Exp Arroz
Ano            2017      2018      2019      2017      2018      2019
País
Argentina -0.611300 -0.406731  0.341825  0.881105 -1.165026 -0.041522
Brasil     1.577931  0.678801  1.475823 -0.125352  0.284601 -1.302204

In [37]:
df2['Exp Trigo']

Ano            2017      2018      2019
País
Argentina -0.611300 -0.406731  0.341825
Brasil     1.577931  0.678801  1.475823

In [38]:
df2.xs(2017, axis=1, level=1)

           Exp Trigo  Exp Arroz
País
Argentina  -0.611300   0.881105
Brasil      1.577931  -0.125352